[
    {
        "id": "a050",
        "chefId": 1,
        "recipeName": "Spaghetti Carbonara",
        "ingredients": [
            "spaghetti",
            "pancetta",
            "egg yolks",
            "pecorino romano cheese",
            "black pepper",
            "salt",
            "olive oil"
        ],
        "cookingMethod": "1. Cook spaghetti in a large pot of salted boiling water.\n2. Meanwhile, cook pancetta in a skillet until crispy. \n3. In a bowl, whisk together egg yolks, pecorino romano cheese, black pepper, and a pinch of salt.\n4. Drain spaghetti, reserving 1/2 cup of the cooking water. \n5. Add spaghetti to the skillet with pancetta, and toss to coat with the fat. \n6. Remove from heat and add the egg mixture, tossing quickly to avoid curdling. Add reserved cooking water as necessary to create a silky sauce. \n7. Serve immediately with additional cheese and black pepper to taste.",
        "rating": 4.8
    },
    {
        "id": "a060",
        "chefId": 1,
        "recipeName": "Margherita Pizza",
        "ingredients": [
            "pizza dough",
            "san marzano tomatoes",
            "mozzarella cheese",
            "fresh basil leaves",
            "extra-virgin olive oil",
            "salt",
            "garlic"
        ],
        "cookingMethod": "1. Preheat oven to 500°F.\n2. Stretch pizza dough to desired size and shape.\n3. Top pizza dough with san marzano tomatoes, garlic, and salt.\n4. Top with mozzarella cheese.\n5. Drizzle with extra-virgin olive oil.\n6. Bake for 8-10 minutes, or until crust is golden brown and cheese is melted.\n7. Top with fresh basil leaves and serve immediately.",
        "rating": 4.5
    },
    {
        "id": "a070",
        "chefId": 5,
        "recipeName": "Pesto Pasta Salad",
        "ingredients": [
            "1 pound fusilli pasta",
            "1/2 cup prepared pesto",
            "1/2 cup mayonnaise",
            "1/2 cup sour cream",
            "1/2 cup grated Parmesan cheese",
            "1/2 cup sliced black olives",
            "1/2 cup chopped sun-dried tomatoes",
            "1/4 cup chopped fresh basil leaves",
            "1/4 teaspoon salt",
            "1/4 teaspoon black pepper"
        ],
        "cookingMethod": "1. Bring a large pot of salted water to a boil. Add the pasta and cook until al dente, about 8 minutes. Drain and rinse under cold water.\n2. In a large bowl, whisk together the pesto, mayonnaise, sour cream, Parmesan cheese, olives, sun-dried tomatoes, basil, salt, and pepper.\n3. Add the pasta to the bowl and toss to coat with the dressing. Serve immediately, or chill until ready to serve.",
        "rating": 4.7
    },
    {
        "id": "a080",
        "chefId": 2,
        "recipeName": "Lasagna Bolognese",
        "ingredients": [
            "lasagna noodles",
            "ground beef",
            "ground pork",
            "onion",
            "carrots",
            "celery",
            "tomato paste"
        ],
        "cookingMethod": "1. Cook lasagna noodles in a large pot of salted boiling water.\n2. Meanwhile, cook ground beef and ground pork in a skillet over medium heat until browned.\n3. Add diced onion, carrots, and celery to the skillet and sauté until vegetables are tender.\n4. Add tomato paste and cook for an additional 5 minutes.\n5. Preheat oven to 375°F.\n6. In a greased baking dish, layer lasagna noodles, meat sauce, and shredded cheese, repeating until all ingredients are used.\n7. Bake for 25-30 minutes, or until cheese is melted and bubbly.\n8. Let cool for 5 minutes before serving.",
        "rating": 4.9
    },
    {
        "id": "a090",
        "chefId": 1,
        "recipeName": "Spaghetti Carbonara",
        "ingredients": [
            "200g spaghetti",
            "150g pancetta, diced",
            "2 large eggs",
            "50g parmesan cheese, grated",
            "2 cloves garlic, minced",
            "Salt",
            "Black pepper"
        ],
        "cookingMethod": "1. Cook spaghetti according to package directions. \n2. In a pan, fry pancetta over medium heat until crispy. \n3. In a bowl, whisk together eggs, parmesan cheese, garlic, salt, and pepper. \n4. Drain spaghetti and add it to the pan with pancetta. Turn off heat. \n5. Add egg mixture to the pan and toss quickly to coat. The residual heat from the spaghetti and pancetta will cook the eggs. \n6. Serve immediately.",
        "rating": 4.5
    },
    {
        "id": "a100",
        "chefId": 2,
        "recipeName": "Pesto Sauce",
        "ingredients": [
            "50g basil leaves",
            "50g pine nuts",
            "50g parmesan cheese, grated",
            "2 cloves garlic, minced",
            "100ml olive oil",
            "Salt",
            "Black pepper"
        ],
        "cookingMethod": "1. Combine basil leaves, pine nuts, parmesan cheese, and garlic in a food processor. Pulse until finely chopped. \n2. With the motor running, slowly add olive oil until a smooth paste forms. \n3. Season with salt and black pepper to taste. \n4. Store in an airtight container in the refrigerator for up to 1 week.",
        "rating": 4.2
    },
    {
        "id":"a110",
        "chefId": 3,
        "recipeName": "Margherita Pizza",
        "ingredients": [
            "250g pizza dough",
            "100g tomato sauce",
            "100g mozzarella cheese, grated",
            "10 basil leaves",
            "2 cloves garlic, minced",
            "Olive oil",
            "Salt"
        ],
        "cookingMethod": "1. Preheat oven to 220°C. \n2. On a floured surface, roll out pizza dough into a 30cm circle. \n3. Transfer dough to a pizza stone or baking sheet. \n4. Spread tomato sauce over the dough, leaving a 2cm border around the edge. \n5. Sprinkle mozzarella cheese over the sauce. \n6. Tear basil leaves into small pieces and sprinkle over the cheese. \n7. Drizzle a little olive oil over the pizza. \n8. Bake in the oven for 10-12 minutes or until crust is golden brown. \n9. Sprinkle a little salt over the pizza before serving.",
        "rating": 4.8
    },
    {
        "id": "a120",
        "chefId": 2,
        "recipeName": "Risotto with Asparagus and Peas",
        "ingredients": [
            "1 1/2 cups Arborio rice",
            "4 cups chicken or vegetable stock",
            "1/4 cup unsalted butter",
            "1/2 cup chopped onion",
            "1/2 cup dry white wine",
            "1/2 pound asparagus, cut into 1-inch pieces",
            "1/2 cup frozen peas",
            "1/2 cup freshly grated Parmesan cheese",
            "Salt and freshly ground black pepper"
        ],
        "cookingMethod": "In a large saucepan, bring the chicken or vegetable stock to a simmer. In a separate large saucepan, melt 2 tablespoons of the butter over medium heat. Add the onion and cook until softened, about 5 minutes. Add the Arborio rice and stir to coat with the butter. Add the wine and stir until the liquid is absorbed. Add a ladleful of the hot stock to the rice and stir until the liquid is absorbed. Continue adding the stock, one ladleful at a time, stirring constantly and allowing each addition to be absorbed before adding the next. When the rice is almost tender, after about 18 minutes, add the asparagus and peas and cook until tender, about 4 minutes. Stir in the remaining 2 tablespoons of butter and the Parmesan cheese. Season with salt and pepper to taste.",
        "rating": 4.5
    },
    {
        "id": "a130",
        "chefId": 6,
        "recipeName": "Pasta with Eggplant and Tomatoes",
        "ingredients": [
            "1 pound pasta",
            "1 large eggplant, peeled and diced",
            "2 cups diced tomatoes",
            "2 cloves garlic, minced",
            "1/4 teaspoon red pepper flakes",
            "1/4 cup chopped fresh basil",
            "1/4 cup grated Pecorino Romano cheese"
        ],
        "cookingMethod": "Bring a large pot of salted water to a boil. Add the pasta and cook until al dente, according to package directions. Meanwhile, in a large skillet, heat 2 tablespoons of olive oil over medium heat. Add the eggplant and cook until softened and golden brown, about 10 minutes. Add the tomatoes, garlic, and red pepper flakes and cook until the tomatoes have broken down and the sauce is thick and bubbly, about 10 minutes. Drain the pasta and add it to the skillet with the sauce. Toss to coat the pasta with the sauce. Stir in the basil and Pecorino Romano cheese. Serve hot.",
        "rating": 4.2
    },
    {
        "id": "a140",
        "chefId": 6,
        "recipeName": "Pesto Pasta Salad",
        "ingredients": [
            "1 pound fusilli pasta",
            "1 cup cherry tomatoes, halved",
            "1 cup fresh mozzarella balls, halved",
            "1/2 cup chopped fresh basil",
            "1/4 cup pine nuts",
            "3 cloves garlic, minced",
            "1/2 cup olive oil",
            "1/2 cup grated Parmesan cheese",
            "Salt and black pepper, to taste"
        ],
        "cookingMethod": "1. Cook pasta according to package directions until al dente. Drain and rinse with cold water.\n2. In a large bowl, combine cooked pasta, cherry tomatoes, mozzarella, and chopped basil.\n3. In a food processor, pulse pine nuts and garlic until finely chopped. Add olive oil and Parmesan cheese and blend until smooth.\n4. Pour pesto sauce over the pasta salad and toss until well coated. Season with salt and black pepper to taste.\n5. Chill in the refrigerator for at least 30 minutes before serving.",
        "rating": 4.5
    },
    {
        "id": "a150",
        "chefId": 4,
        "recipeName": "Spaghetti Carbonara",
        "ingredients": [
            "1 pound spaghetti",
            "6 slices bacon, chopped",
            "4 large eggs",
            "1/2 cup grated Parmesan cheese",
            "1/2 cup grated Pecorino Romano cheese",
            "4 cloves garlic, minced",
            "Salt and black pepper, to taste"
        ],
        "cookingMethod": "1. Cook spaghetti in a large pot of salted boiling water until al dente. Reserve 1/2 cup of the pasta cooking water, then drain the spaghetti.\n2. In a large skillet, cook chopped bacon over medium heat until crispy. Remove bacon from the pan and set aside.\n3. In a small bowl, whisk together eggs, Parmesan cheese, Pecorino Romano cheese, garlic, salt, and black pepper.\n4. Add cooked spaghetti to the skillet with the bacon and toss to combine. Remove skillet from heat.\n5. Add egg mixture to the skillet and quickly toss with the spaghetti until the eggs are cooked and the pasta is coated in a creamy sauce. If the pasta is too dry, add reserved pasta cooking water a little at a time to moisten it.\n6. Serve hot, garnished with additional Parmesan cheese and black pepper if desired.",
        "rating": 4.8
    },
    {
        "id": "a160",
        "chefId": 5,
        "recipeName": "Tiramisu",
        "ingredients": [
            "mascarpone cheese",
            "heavy cream",
            "sugar",
            "vanilla extract",
            "ladyfingers",
            "espresso",
            "cocoa powder"
        ],
        "cookingMethod": "In a large bowl, beat heavy cream until stiff peaks form. In a separate bowl, beat mascarpone cheese, sugar, and vanilla extract until creamy. Gently fold in whipped cream. Dip ladyfingers in espresso and layer them in a 9x13 inch dish. Spread a layer of the mascarpone mixture on top of the ladyfingers. Repeat layers. Dust with cocoa powder. Refrigerate for at least 2 hours. Serve chilled.",
        "rating": 4.8
    },
    {
        "id": "a170",
        "chefId": 3,
        "recipeName": "Spaghetti Carbonara",
        "ingredients": [
            "spaghetti",
            "bacon",
            "eggs",
            "Parmesan cheese",
            "pepper",
            "salt",
            "olive oil"
        ],
        "cookingMethod": "Cook spaghetti according to package directions until al dente. In a large skillet, cook bacon over medium heat until crisp. Remove to paper towels with a slotted spoon; drain, reserving 1 tablespoon drippings. In a small bowl, whisk eggs, cheese, pepper and salt until blended. Add spaghetti to pan; toss to coat. Remove from heat. Add egg mixture; toss to combine. Serve immediately.",
        "rating": 4.8
    },
    {
        "id": "a180",
        "chefId": 4,
        "recipeName": "Tiramisu",
        "ingredients": [
            "mascarpone cheese",
            "ladyfingers",
            "espresso coffee",
            "rum",
            "sugar",
            "eggs",
            "cocoa powder"
        ],
        "cookingMethod": "In a bowl, whisk together egg yolks and sugar until well blended. Beat in mascarpone cheese until smooth. In a separate bowl, beat cream until stiff peaks form. Fold whipped cream into mascarpone mixture. In a small bowl, combine coffee and rum. Dip ladyfingers in mixture and arrange in a single layer in an 8 inch square dish. Spread half of mascarpone mixture over ladyfingers, then repeat with another layer of ladyfingers and mascarpone mixture. Cover and refrigerate for at least 2 hours or overnight. Before serving, sprinkle cocoa powder on top.",
        "rating": 4.7
    },
    {
        "id": "a190",
        "chefId": 6,
        "recipeName": "Spaghetti alla Carbonara",
        "ingredients": [
            "spaghetti",
            "pancetta",
            "pecorino cheese",
            "egg yolks",
            "garlic",
            "olive oil",
            "black pepper"
        ],
        "cookingMethod": "Cook spaghetti in a large pot of boiling salted water until al dente. Meanwhile, cook pancetta and garlic in olive oil in a large skillet over medium heat until pancetta is browned and crisp. Whisk together egg yolks, pecorino cheese, and black pepper in a bowl. Drain spaghetti, reserving 1/2 cup pasta cooking water. Add spaghetti and pasta cooking water to skillet with pancetta and toss to coat. Remove skillet from heat and add egg yolk mixture, tossing until spaghetti is coated and creamy.",
        "rating": "4.8"
    },
    {
        "id": "a200",
        "chefId": 5,
        "recipeName": "Linguine alle Vongole",
        "ingredients": [
            "linguine",
            "clams",
            "garlic",
            "white wine",
            "olive oil",
            "red pepper flakes",
            "parsley"
        ],
        "cookingMethod": "Cook linguine in a large pot of boiling salted water until al dente. Meanwhile, heat olive oil and red pepper flakes in a large skillet over medium heat. Add garlic and cook until fragrant. Add clams and white wine and cook until clams open, discarding any that do not. Drain linguine, reserving 1/2 cup pasta cooking water. Add linguine and pasta cooking water to skillet with clams and toss to coat. Sprinkle with parsley and serve.",
        "rating": "4.6"
    },
    {
        "id": "a210",
        "chefId": 3,
        "recipeName": "Pesto Pasta Salad",
        "ingredients": [
            "1 pound fusilli pasta",
            "2 cups basil leaves",
            "2 garlic cloves",
            "1/2 cup pine nuts",
            "1/2 cup grated Parmesan cheese",
            "1/2 cup extra-virgin olive oil",
            "Salt and freshly ground black pepper to taste"
        ],
        "cookingMethod": "1. Cook pasta in salted boiling water until al dente. Drain and rinse with cold water.\n2. In a food processor, blend basil, garlic, pine nuts and Parmesan cheese until smooth. Slowly pour in olive oil while processing until combined. Season with salt and pepper to taste.\n3. In a large bowl, toss the pasta with the pesto sauce until coated. Chill in the refrigerator for at least 30 minutes before serving.",
        "rating": "4.8"
    },
    {
        "id": "a220",
        "chefId": 5,
        "recipeName": "Burrata and Tomato Salad",
        "ingredients": [
            "1 pound ripe tomatoes, sliced",
            "8 oz burrata cheese",
            "2 tbsp extra-virgin olive oil",
            "1 tbsp balsamic vinegar",
            "1 tbsp chopped fresh basil",
            "Salt and freshly ground black pepper to taste"
        ],
        "cookingMethod": "1. Arrange tomato slices and burrata cheese on a serving platter.\n2. In a small bowl, whisk together olive oil, balsamic vinegar and chopped basil. Season with salt and pepper to taste.\n3. Drizzle the dressing over the tomato and burrata. Serve immediately.",
        "rating": "4.5"
    },
    {
        "id": "a230",
        "chefId": 3,
        "recipeName": "Linguine alle vongole",
        "ingredients": [
            "linguine",
            "vongole",
            "garlic",
            "olive oil",
            "white wine",
            "parsley",
            "red pepper flakes"
        ],
        "cookingMethod": "Cook linguine according to package instructions. In a large skillet, heat olive oil over medium heat. Add garlic and red pepper flakes, cook for 30 seconds. Add clams and white wine. Cook until clams open, about 5-7 minutes. Add cooked linguine and parsley, toss to combine. Serve immediately.",
        "rating": 4.5
    },
    {
        "id": "a240",
        "chefId": 4,
        "recipeName": "Osso Buco",
        "ingredients": [
            "4 veal shanks, about 1 1/2 pounds each",
            "Salt and freshly ground black pepper",
            "1/2 cup all-purpose flour",
            "1/4 cup vegetable oil",
            "1 large onion, diced",
            "2 carrots, diced",
            "2 celery stalks, diced",
            "6 garlic cloves, minced",
            "1 tablespoon tomato paste",
            "1 cup dry white wine",
            "2 cups chicken stock",
            "2 cups canned crushed tomatoes",
            "2 sprigs fresh thyme",
            "2 bay leaves",
            "1/4 cup chopped fresh parsley leaves"
        ],
        "cookingMethod": "1. Preheat the oven to 325 degrees F.\n2. Season the veal shanks generously with salt and pepper. Dredge the shanks in the flour to coat lightly, shaking off any excess.\n3. In a large Dutch oven or heavy pot, heat the oil over medium-high heat. Add the shanks and brown well on all sides, about 8 minutes per side. Transfer the shanks to a platter and set aside.\n4. Add the onion, carrots, and celery to the pot and cook, stirring, until the vegetables are soft, about 5 minutes. Add the garlic and cook for 1 minute. Stir in the tomato paste and cook for 1 minute. Add the wine and bring to a boil, scraping the bottom of the pot with a wooden spoon to loosen any browned bits. Add the stock, tomatoes, thyme, bay leaves, and parsley, and stir well.\n5. Return the shanks to the pot and spoon some of the sauce over them. Bring the mixture to a simmer, cover, and transfer to the oven. Bake until the meat is very tender and falls off the bone, about 2 1/2 hours. Remove from the oven and let cool for a few minutes.\n6. Using tongs, transfer the shanks to a platter. Skim the fat from the surface of the sauce and discard the bay leaves and thyme stems. Spoon the sauce over the shanks and serve.",
        "rating": 4.9
    }
]